app/views/articles/_form.html.erb

    <%= a.label :author %><br>
    <%= collection_select(:article, :author_id, Author.all, :id, :last_name, include_blank: true) %>
---
SELECT "authors".* FROM "authors"

  <p>
    <%= collection_check_boxes(:article, :tag_ids, Tag.all, :id, :name) %>
---
SELECT "tags".* FROM "tags"