app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "body", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Title 2"], ["body", "Body 2"], ["author_id", 2], ["created_at", "2016-03-21 19:58:40.096715"], ["updated_at", "2016-03-21 19:58:40.096715"]]

  def update
    if @article.update(article_params)
---
UPDATE "articles" SET "title" = ?, "author_id" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Title 1"], ["author_id", 1], ["updated_at", "2016-03-21 20:02:26.145842"], ["id", 1]]

  def find_article
    @article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]