app/controllers/authors_controller.rb

SELECT "authors".* FROM "authors"
---
  def index
    @authors = Author.all

INSERT INTO "authors" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Author2First"], ["last_name", "Author2Last"], ["created_at", "2016-03-21 18:01:45.726909"], ["updated_at", "2016-03-21 18:01:45.726909"]]
---
  def create
    @author = Author.new(author_params)

    if @author.save

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 2]]
---
  def find_author
    @author = Author.find(params[:id])