app/controllers/tags_controller.rb

  def index
    @tags = Tag.all
---
SELECT "tags".* FROM "tags"

  def create
    @tag = Tag.new(tags_params)

    if @tag.save
---
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Tag 2"], ["created_at", "2016-03-21 19:57:28.066164"], ["updated_at", "2016-03-21 19:57:28.066164"]]

  def find_tag
    @tag = Tag.find(params[:id])
---
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", 2]]